package mainheroinfo

import (
	"math/rand"
)

// Функция, рандомно вызвращающая рассу персонажа
func RandomRace() string {
	races := map[int]string{
		1:  "Холмовой Дварф",
		2:  "Горный Дварф",
		3:  "Крепкий Полурослик",
		4:  "Легконогий Полурослик",
		5:  "Человек",
		6:  "Высший Эльф",
		7:  "Лесной Эльф",
		8:  "Дроу",
		9:  "Лесной Гном",
		10: "Скальный Гном",
		11: "Драконорождённый",
		12: "Полуорк",
		13: "Полуэльф",
		14: "Тифлинг",
	}

	// Генерируем случайное число, чтобы выбрать случайную рассу в соответствии с мапой
	rr := rand.Intn(14) + 1
	total_race := "Поздравляю, авантюрист! Ты теперь " + races[rr]
	return total_race // возвращаем рассу
}

func RandomClass() string {
	classes := map[int]string{
		1:  "Бард",
		2:  "Варвар",
		3:  "Воин",
		4:  "Волшебник",
		5:  "Друид",
		6:  "Жрец",
		7:  "Колдун",
		8:  "Монах",
		9:  "Паладин",
		10: "Плут",
		11: "Следопыт",
		12: "Чародей",
	}
	rc := rand.Intn(12) + 1
	total_class := "Твой класс: " + classes[rc]
	return total_class // возвращаем класс
}

func RandomBackground() string {
	backgrounds := map[int]string{
		1:  "Артист",
		2:  "Благородный",
		3:  "Бродяга",
		4:  "Моряк",
		5:  "Мудрец",
		6:  "Народный герой",
		7:  "Отшельник",
		8:  "Послушник",
		9:  "Преступник",
		10: "Ремесленник из гильдии",
		11: "Солдат",
		12: "Чужеземец",
		13: "Шарлатан",
	}
	rb := rand.Intn(14) + 1
	total_background := "А по происхождению ты " + backgrounds[rb]
	return total_background // возвращаем рассу
}

func RandomAlignment() string {
	alignment := map[int]string{
		1: "Законопослушный добрый",
		2: "Законопослушный нейтральный",
		3: "Законопослушный злой",
		4: "Хаотичный добрый",
		5: "Хаотичный нейтральный",
		6: "Хаотичный злой",
		7: "Нейтральный добрый",
		8: "Нейтральный",
		9: "Нейтральный хаотичный",
	}
	ra := rand.Intn(14) + 1
	total_alignment := "А по происхождению ты " + alignment[ra]
	return total_alignment // возвращаем рассу
}
