// Файл с инструментами, которыми может владеть Герой. Разбиты по кратегориям.
package heroabilities

func Toolkits() map[int]string { // Инструменты, которые не подошли в категории ниже
	toolkits := map[int]string{
		1: "Инструменты Вора",
		2: "Инструменты Навигатора",
		3: "Маскировочный набор",
		4: "Набор для подделки",
		5: "Набор отравителя",
		6: "Набор травника",
	}
	return toolkits
}

func CraftsmanToolkits() map[int]string { // Инструменты ремесленников гильдии
	craftsman_toolskit := map[int]string{
		1:  "Инструменты Алхимика",
		2:  "Инструменты Гончара",
		3:  "Инструменты Каллиграфа",
		4:  "Инструменты Каменщика",
		5:  "Инструменты Картографа",
		6:  "Инструменты Кожевенника",
		7:  "Инструменты Кузнеца",
		8:  "Инструменты Механика",
		9:  "Инструменты Пивовара",
		10: "Инструменты Плотника",
		11: "Инструменты Повара",
		12: "Инструменты Резчика",
		13: "Инструменты Сапожника",
		14: "Инструменты Стеклодува",
		15: "Инструменты Ткача",
		16: "Инструменты Художника",
		17: "Инструменты Ювелира",
	}
	return craftsman_toolskit
}

func MusicialInstruments() map[int]string { // Музыкальные инструменты
	musicial_instruments := map[int]string{
		1:  "Барабан",
		2:  "Виола",
		3:  "Волынка",
		4:  "Горн",
		5:  "Лира",
		6:  "Лютня",
		7:  "Сиринга",
		8:  "Флейта",
		9:  "Цимбалы",
		10: "Шалмей",
	}
	return musicial_instruments
}

func Boardgames() map[int]string { // Настольные игры
	boardgames := map[int]string{
		1: "Драконьи шахматы",
		2: "Игральные карты",
		3: "Кости",
		4: "Ставка Трёх Драконов",
	}
	return boardgames
}
